// 13*. Дан массив [1, 2, 3, 4, 5, 6]. Сделать из него массив [5, 6, 3, 4, 1, 2]
//
// let array = [1, 2, 3, 4, 5, 6];
//
// function sort(arr) {
//     let array2 = [];
//
//     for (let i = 0; i < array.length; i += 2) {
//         array2.push(array[i + 4], array[i + 5], array[i + 2], array[i + 3], array[i], array[i + 1]);
//         break;
//     }
//     return array2
// }
//
// console.log(sort(array));



// 14*. Дан двухмерный массив с числами, [[1, 2, 3], [4, 5], [6]]. Найдите сумму
// элементов этого массива.

// let array = [[1, 2, 3, 4, 5, 6], [4, 5], [6]];
//
// function arrayMath(arr) {
//     let arr2 = 0;
//
//     for (let i = 0; i < arr.length; i++) {
//
//         for (let j = 0; j < arr[i].length; j++) {
//             arr2 += arr[i][j];
//         }
//     }
//     console.log(arr2);
// }
//
// arrayMath(array);



// 15* Написать функцию которая принимает в себя строку ( пример : 'Hello world' ) , функция должна вернуть фразу
// наоборот ( пример : 'dlrow olleH')
//
// let test = 'Hello world';
//
// function turnover(str) {
//     let newStr = [];
//
//     for (let i = str.length - 1; i >= 0; i--) {
//         newStr.push(str[i]);
//     }
//
//     console.log(newStr.join(''))
// }
//
// turnover(test);


// 15*. нарисовать матрицу x должны быть по краям, 0 в центре. ( длина и высота матрицы не меньше 10 )
// ['x', 'x', 'x', 'x', 'x' 'x', 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 'x', 'x', 'x', 'x', 'x','x']
//
// let result = [];
//
// for (let i = 0; i <= 10; i++) {
//     let horizontal = [];
//
//     for (let j = 0; j <= 10; j++) {
//         let el = i === 0 || j === 0 || i === 10 || j === 10 ? 'x' : 0;
//         horizontal.push(el)
//     }
//     result.push(horizontal);
// }
//
// console.log(result);



// 16*. нарисовать матрицу (таблица умножения)
// 0: (10) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// 1: (10) [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
// 2: (10) [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
// 3: (10) [4, 8, 12, 16, 20, 24, 28, 32, 36, 40]
// 4: (10) [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
// 5: (10) [6, 12, 18, 24, 30, 36, 42, 48, 54, 60]
// 6: (10) [7, 14, 21, 28, 35, 42, 49, 56, 63, 70]
// 7: (10) [8, 16, 24, 32, 40, 48, 56, 64, 72, 80]
// 8: (10) [9, 18, 27, 36, 45, 54, 63, 72, 81, 90]
// 9: (10) [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
//
// let result = [];
//
// for (let i = 1; i <= 10; i++) {
//     let horizontal = [];
//
//     for (let j = 1; j <= 10; j++) {
//         let math = i * j;
//         horizontal.push(math)
//     }
//     result.push(horizontal)
// }
//
// console.log(result);
